  CLogger.cpp
  main.cpp
  class CLogger	size(8):
  	+---
   0	| {vfptr}
   4	| LogLevels level
  	+---
  CLogger::$vftable@:
  	| &CLogger_meta
  	|  0
   0	| &CLogger::output
  CLogger::output this adjustor: 0
  class CLogger	size(8):
  	+---
   0	| {vfptr}
   4	| LogLevels level
  	+---
  CLogger::$vftable@:
  	| &CLogger_meta
  	|  0
   0	| &CLogger::output
  CLogger::output this adjustor: 0
  正在生成代码...
  loggers_module.c
  TLogger.c
  TAlignedMemory.c
  memories_module.c
  TMemory.c
  TestLogger.c
  TestMemory.c
  正在生成代码...
  Fact.vcxproj -> D:\Yitek\FactPattern\Debug\Fact.exe
