  main.cpp
  class _s__RTTIBaseClassArray	size(1):
  	+---
   0	| arrayOfBaseClassDescriptors
  	+---
  class ClassA	size(8):
  	+---
   0	| {vfptr}
   4	| classA_value
  	+---
  ClassA::$vftable@:
  	| &ClassA_meta
  	|  0
   0	| &ClassA::get_type
  ClassA::get_type this adjustor: 0
  Fact.vcxproj -> D:\Yitek\FactPattern\Debug\Fact.exe
